In [3]:
from pandas import DataFrame
df=DataFrame(
            [
                ['Aryan','Singh','Full Time','administraction',2,20000],
                ['Rohan','Agarwal','intern','Technical',3,50000],
                ['Rjya','Shah','Full Time','administraction',5,100000],
                ['Yash','Bhaita','Part Time','Technical',7,100000],
                ['Siddhant','Khanna','Full Time','Management',6,200000],
            ]
            ,columns=['Frist Name','Last Name','Type','Department','YoE','Salary']
            )
df

  Frist Name Last Name       Type       Department  YoE  Salary
0      Aryan     Singh  Full Time  administraction    2   20000
1      Rohan   Agarwal     intern        Technical    3   50000
2       Rjya      Shah  Full Time  administraction    5  100000
3       Yash    Bhaita  Part Time        Technical    7  100000
4   Siddhant    Khanna  Full Time       Management    6  200000

1.Make a pivot table which shows average salary of each type of employee for each department.

In [5]:
import pandas as pd
table=pd.pivot_table(df,index='Type',columns='Department',values='Salary',aggfunc='sum')
table

Department  Management  Technical  administraction
Type
Full Time     200000.0        NaN         120000.0
Part Time          NaN   100000.0              NaN
intern             NaN    50000.0              NaN

2. Make a pivot table which shows the sum and mean of the salaries of each type of employee and the number of employees of each type.

In [6]:
table =pd.pivot_table(df,index='Type',values='Salary',aggfunc=['sum','mean','count'])
table

              sum           mean  count
           Salary         Salary Salary
Type
Full Time  320000  106666.666667      3
Part Time  100000  100000.000000      1
intern      50000   50000.000000      1